In [1]:
import pandas as pd

In [26]:
index=["영희","철수","영철","순자"]
data = {
    "나이" : [20,21,20,20],
    "지역" : ["서울","대구","서울",'서울'],
    "키" : [157,175,180,165]
}
info = pd.DataFrame(data, index = index)
info

    나이  지역    키
영희  20  서울  157
철수  21  대구  175
영철  20  서울  180
순자  20  서울  165

In [27]:
info.groupby("나이").나이.count()

나이
20    3
21    1
Name: 나이, dtype: int64

In [28]:
info.groupby("나이").지역.count()

나이
20    3
21    1
Name: 지역, dtype: int64

In [29]:
info.groupby("나이").키.count()

나이
20    3
21    1
Name: 키, dtype: int64

In [30]:
info.groupby("나이").size()

나이
20    3
21    1
dtype: int64

In [31]:
info["나이"]

영희    20
철수    21
영철    20
순자    20
Name: 나이, dtype: int64

In [32]:
info["나이"].value_counts()

20    3
21    1
Name: 나이, dtype: int64

In [33]:
info.groupby(["나이","지역"]).size()

나이  지역
20  서울    3
21  대구    1
dtype: int64

In [9]:
info.groupby(["나이","지역"]).키.count()

나이  지역
20  서울    3
21  대구    1
Name: 키, dtype: int64

In [10]:
info.groupby(["나이","지역"]).value_counts()

나이  지역  키
20  서울  157    1
        165    1
        180    1
21  대구  175    1
dtype: int64

In [11]:
info.groupby("나이").키.min()

나이
20    157
21    175
Name: 키, dtype: int64

In [12]:
info.groupby("나이", group_keys=True).apply(lambda x: x)

       나이  지역    키
나이
20 영희  20  서울  157
   영철  20  서울  180
   순자  20  서울  165
21 철수  21  대구  175

In [13]:
info.groupby("지역", group_keys=True).apply(lambda x: x)

       나이  지역    키
지역
대구 철수  21  대구  175
서울 영희  20  서울  157
   영철  20  서울  180
   순자  20  서울  165

In [14]:
info.groupby("지역").apply(lambda df:df["나이"].iloc[0])

지역
대구    21
서울    20
dtype: int64

In [15]:
info.groupby(["지역","나이"]).apply(lambda df:df.loc[df.키.idxmax()])

       나이  지역    키
지역 나이
대구 21  21  대구  175
서울 20  20  서울  180

In [16]:
info.groupby(["나이","지역"]).apply(lambda df:df.loc[df.키.idxmin()])

       나이  지역    키
나이 지역
20 서울  20  서울  157
21 대구  21  대구  175

In [17]:
info.groupby('나이').키.agg([len,min,max,sum])

    len  min  max  sum
나이
20    3  157  180  502
21    1  175  175  175

In [18]:
a = info.groupby(['나이','지역']).키.agg([len])
print(a)

       len
나이 지역
20 서울    3
21 대구    1

In [19]:
a.reset_index()

   나이  지역  len
0  20  서울    3
1  21  대구    1

In [20]:
a.sort_values(by='len')

       len
나이 지역
21 대구    1
20 서울    3

In [21]:
a.sort_index()

       len
나이 지역
20 서울    3
21 대구    1

In [22]:
a.sort_values(by=['나이','len'], ascending=[False, True])

       len
나이 지역
21 대구    1
20 서울    3

In [23]:
a = info.groupby(['지역']).키.agg([len]).sort_index(ascending=False)
print(a)

    len
지역
서울    3
대구    1

In [24]:
index = ["영희", "철수", "영철", "순자", "민수"]
data = {
    "나이": [20, 20, 20, 20, 20],
    "지역": ["서울", "대구", "서울", "서울", "서울"],
    "키": [157, 175, 180, 157, 165]  # 중복된 키 값 157 추가
}
info = pd.DataFrame(data, index=index)

# 결과 확인
size_result = info.groupby(["나이", "지역"]).size()
value_counts_result = info.groupby(["나이", "지역"]).value_counts()

print("Size Result:")
print(size_result)

print("\nValue Counts Result:")
print(value_counts_result)

Size Result:
나이  지역
20  대구    1
    서울    4
dtype: int64

Value Counts Result:
나이  지역  키
20  대구  175    1
    서울  157    2
        165    1
        180    1
dtype: int64